---
kind: type
id: T:Autodesk.Revit.DB.ImageExportOptions
source: html/c2e823a1-6eb0-2bf3-f07b-ed46d8f7b70a.htm
---
# Autodesk.Revit.DB.ImageExportOptions

This class defines options for exporting views and sheets as an image.

## Syntax (C#)
```csharp
public class ImageExportOptions : IDisposable
```